In [1]:
import cassandra
print(cassandra.__version__)

3.25.0

In [2]:
from cassandra.cluster import Cluster
from cassandra.auth import PlainTextAuthProvider

cloud_config= {'secure_connect_bundle': 'D:\\iNeuron\\FSDS\\19.4 Cassandra\\secure-connect-test.zip'}
auth_provider = PlainTextAuthProvider('DcFNgDqawcXQrcfvHlauFfqr', 'RZWf-NteEFDTysDDyzY07NZkszhoKKHr2p8XUwJCUZmDlBEiHHDH09CH7+QrO9ryCN6aLfpQ7dOp,NhuJhkftw782B9apwpMT9EZwncujEooERMKfwpDfGgpr1mS9CMI')
cluster = Cluster(cloud=cloud_config, auth_provider=auth_provider)
session = cluster.connect()

row = session.execute("select release_version from system.local").one()
if row:
    print(row[0])
else:
    print("An error occurred.")

4.0.0.6813

# Selection of Keyspace

In [5]:
row1 = session.execute("use ineuron").one()

# Creation of Table

In [6]:
row1 = session.execute("create table Emp(EMP_ID TEXT PRIMARY KEY, EMP_NAME TEXT, EMP_ROLE TEXT, EMP_LEVEL INT);")

In [7]:
print(row1)

<cassandra.cluster.ResultSet object at 0x000002822704A0A0>

In [11]:
for i in row1 :
    print(i[0])

# Insertion of Values in the Table.

In [10]:
row2 = session.execute("insert into Emp(EMP_ID, EMP_NAME, EMP_ROLE, EMP_LEVEL) values ('1234','Shreevastav','SE',11);")

In [12]:
session.execute("insert into Emp(EMP_ID, EMP_NAME, EMP_ROLE, EMP_LEVEL) values ('1235','Shreevastav','SE',11);")
session.execute("insert into Emp(EMP_ID, EMP_NAME, EMP_ROLE, EMP_LEVEL) values ('1236','Ganesh','SSE',11);")
session.execute("insert into Emp(EMP_ID, EMP_NAME, EMP_ROLE, EMP_LEVEL) values ('1237','Vatsa','ASE',11);")
session.execute("insert into Emp(EMP_ID, EMP_NAME, EMP_ROLE, EMP_LEVEL) values ('1238','Shivraj','TL',11);")
session.execute("insert into Emp(EMP_ID, EMP_NAME, EMP_ROLE, EMP_LEVEL) values ('1239','Sandesh','AM',11);")

In [13]:
row3 = session.execute("select * from Emp;")
for i in row3:
    print(i)

Row(emp_id='1238', emp_level=11, emp_name='Shivraj', emp_role='TL')
Row(emp_id='1234', emp_level=11, emp_name='Shreevastav', emp_role='SE')
Row(emp_id='1235', emp_level=11, emp_name='Shreevastav', emp_role='SE')
Row(emp_id='1237', emp_level=11, emp_name='Vatsa', emp_role='ASE')
Row(emp_id='1236', emp_level=11, emp_name='Ganesh', emp_role='SSE')
Row(emp_id='1239', emp_level=11, emp_name='Sandesh', emp_role='AM')

# Get the number of rows present in the table.

In [15]:
row4 = session.execute('select count (*) from Emp;')
for i in row4:
    print(i)

Row(count=6)

# Alter the table

In [16]:
row4 = session.execute('alter table Emp add Score TEXT;')
for i in row4:
    print(i)

# Insertion of new values in the table.

In [20]:
session.execute("insert into Emp(EMP_ID, EMP_NAME, EMP_ROLE, EMP_LEVEL,Score) values ('1235','Shreevastav','SE',11,'71');")

In [21]:
row3 = session.execute("select * from Emp;")
for i in row3:
    print(i)

Row(emp_id='1238', emp_level=11, emp_name='Shivraj', emp_role='TL', score=None)
Row(emp_id='1234', emp_level=11, emp_name='Shreevastav', emp_role='SE', score=None)
Row(emp_id='1235', emp_level=11, emp_name='Shreevastav', emp_role='SE', score='71')
Row(emp_id='1237', emp_level=11, emp_name='Vatsa', emp_role='ASE', score=None)
Row(emp_id='1236', emp_level=11, emp_name='Ganesh', emp_role='SSE', score=None)
Row(emp_id='1239', emp_level=11, emp_name='Sandesh', emp_role='AM', score=None)

In [22]:
session.execute("insert into Emp(EMP_ID, EMP_NAME, EMP_ROLE, EMP_LEVEL,Score) values ('1234','Shreevastav','SE',11,'81');")
session.execute("insert into Emp(EMP_ID, EMP_NAME, EMP_ROLE, EMP_LEVEL,Score) values ('1236','Ganesh','SSE',11,'78');")
session.execute("insert into Emp(EMP_ID, EMP_NAME, EMP_ROLE, EMP_LEVEL,Score) values ('1237','Vatsa','ASE',11,'62');")
session.execute("insert into Emp(EMP_ID, EMP_NAME, EMP_ROLE, EMP_LEVEL,Score) values ('1238','Shivraj','TL',11,'82');")
session.execute("insert into Emp(EMP_ID, EMP_NAME, EMP_ROLE, EMP_LEVEL,Score) values ('1239','Sandesh','AM',11,'80');")

In [23]:
row3 = session.execute("select * from Emp;")
for i in row3:
    print(i)

Row(emp_id='1238', emp_level=11, emp_name='Shivraj', emp_role='TL', score='82')
Row(emp_id='1234', emp_level=11, emp_name='Shreevastav', emp_role='SE', score='81')
Row(emp_id='1235', emp_level=11, emp_name='Shreevastav', emp_role='SE', score='71')
Row(emp_id='1237', emp_level=11, emp_name='Vatsa', emp_role='ASE', score='62')
Row(emp_id='1236', emp_level=11, emp_name='Ganesh', emp_role='SSE', score='78')
Row(emp_id='1239', emp_level=11, emp_name='Sandesh', emp_role='AM', score='80')

# Selection of Minimum Score.

In [25]:
row4 = session.execute('select min(Score) from Emp')
for i in row4:
    print(i)

Row(system_min_score='62')

# Selection of Name of the Employee with maximum score.

In [28]:
row4 = session.execute('select EMP_NAME, max(Score) from Emp')
for i in row4:
    print(i)

Row(emp_name='Shivraj', system_max_score='82')

# Add one more column named “Per Score” and add int valiues to t for all the entries.

In [29]:
row4 = session.execute('alter table Emp add Per_Score INT;')
for i in row4:
    print(i)

In [34]:
session.execute("insert into Emp(EMP_ID, EMP_NAME, EMP_ROLE, EMP_LEVEL,Score,Per_Score) values ('1234','Shreevastav','SE',11,'81',80);")
session.execute("insert into Emp(EMP_ID, EMP_NAME, EMP_ROLE, EMP_LEVEL,Score,Per_Score) values ('1235','Shreevastav','SE',11,'71',75);") 
session.execute("insert into Emp(EMP_ID, EMP_NAME, EMP_ROLE, EMP_LEVEL,Score,Per_Score) values ('1236','Ganesh','SSE',10,'78',80);")
session.execute("insert into Emp(EMP_ID, EMP_NAME, EMP_ROLE, EMP_LEVEL,Score,Per_Score) values ('1237','Vatsa','ASE',12,'62',65);")
session.execute("insert into Emp(EMP_ID, EMP_NAME, EMP_ROLE, EMP_LEVEL,Score,Per_Score) values ('1238','Shivraj','TL',8,'82',85);")
session.execute("insert into Emp(EMP_ID, EMP_NAME, EMP_ROLE, EMP_LEVEL,Score,Per_Score) values ('1239','Sandesh','AM',7,'80',80);")

In [35]:
row3 = session.execute('select * from Emp;')
for i in row3:
    print(i)

Row(emp_id='1238', emp_level=8, emp_name='Shivraj', emp_role='TL', per_score=85, score='82')
Row(emp_id='1234', emp_level=11, emp_name='Shreevastav', emp_role='SE', per_score=80, score='81')
Row(emp_id='1235', emp_level=11, emp_name='Shreevastav', emp_role='SE', per_score=75, score='71')
Row(emp_id='1237', emp_level=12, emp_name='Vatsa', emp_role='ASE', per_score=65, score='62')
Row(emp_id='1236', emp_level=10, emp_name='Ganesh', emp_role='SSE', per_score=80, score='78')
Row(emp_id='1239', emp_level=7, emp_name='Sandesh', emp_role='AM', per_score=80, score='80')

In [32]:
row4 = session.execute('select avg(Per_Score) from Emp;')
for i in row4:
    print(i)

Row(system_avg_per_score=77)

In [36]:
row3 = session.execute('select * from Emp;')
for i in row3:
    print(i)

Row(emp_id='1238', emp_level=8, emp_name='Shivraj', emp_role='TL', per_score=85, score='82')
Row(emp_id='1234', emp_level=11, emp_name='Shreevastav', emp_role='SE', per_score=80, score='81')
Row(emp_id='1235', emp_level=11, emp_name='Shreevastav', emp_role='SE', per_score=75, score='71')
Row(emp_id='1237', emp_level=12, emp_name='Vatsa', emp_role='ASE', per_score=65, score='62')
Row(emp_id='1236', emp_level=10, emp_name='Ganesh', emp_role='SSE', per_score=80, score='78')
Row(emp_id='1239', emp_level=7, emp_name='Sandesh', emp_role='AM', per_score=80, score='80')